ERP.belugaerp/src/InformationRegisters/бг_КодыНоменклатурыСПУМ/бг_КодыНоменклатурыСПУМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_КодыНоменклатурыСПУМ</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>УпаковкаПаллета</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_КодыНоменклатурыСПУМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНоменклатуру(Код) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", Код);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыНоменклатурыСПУМ.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.бг_КодыНоменклатурыСПУМ КАК КодыНоменклатурыСПУМ
	|ГДЕ
	|	КодыНоменклатурыСПУМ.Код = &Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код = &Код";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Номенклатура;
	Иначе
		Номенклатура = Неопределено;
	КонецЕсли;
	
	Возврат Номенклатура;
	
КонецФункции

#КонецОбласти

#КонецЕсли
